onre/discobsd/sys/mk64/startup_mk64fx512.c
	// switch to PLL as clock source, FLL input = 16 MHz / 512
	MCG_C1 = MCG_C1_CLKS(0) | MCG_C1_FRDIV(4);
	// wait for PLL clock to be used
	while ((MCG_S & MCG_S_CLKST_MASK) != MCG_S_CLKST(3)) ;
	// now we're in PEE mode
	// trace is CPU clock, CLKOUT=OSCERCLK0
	// USB uses PLL clock
	SIM_SOPT2 = SIM_SOPT2_USBSRC | SIM_SOPT2_PLLFLLSEL | SIM_SOPT2_TRACECLKSEL | SIM_SOPT2_CLKOUTSEL(6);

	early_irq_init();

	flextimer_init();

	
#if defined(KINETISK)
	// RTC initialization
	if (RTC_SR & RTC_SR_TIF) {
		// this code will normally run on a power-up reset
		// when VBAT has detected a power-up.  Normally our
		// compiled-in time will be stale.  Write a special
		// flag into the VBAT register file indicating the
		// RTC is set with known-stale time and should be
		// updated when fresh time is known.
		#if ARDUINO >= 10600
		rtc_set((uint32_t)&__rtc_localtime);
		#else
		rtc_set(TIME_T);
		#endif
		*(uint32_t *)0x4003E01C = 0x5A94C3A5;
	}
	if ((RCM_SRS0 & RCM_SRS0_PIN) && (*(uint32_t *)0x4003E01C == 0x5A94C3A5)) {
		// this code should run immediately after an upload
		// where the Teensy Loader causes the Mini54 to reset.
		// Our compiled-in time will be very fresh, so set
		// the RTC with this, and clear the VBAT resister file
		// data so we don't mess with the time after it's been
		// set well.
		#if ARDUINO >= 10600
		rtc_set((uint32_t)&__rtc_localtime);
		#else
		rtc_set(TIME_T);
		#endif
		*(uint32_t *)0x4003E01C = 0;
	}
#endif

	main();

	/**
	 * copied verbatim from the stm32 port.
	 */
	
	asm volatile("cpsid i");
	asm volatile("movs r0, #0");
	asm volatile("msr BASEPRI, r0");
	asm volatile("ldr r0, =__user_data_end");
	asm volatile("msr PSP, r0");
	asm volatile("isb");
	asm volatile("dsb");
	asm volatile("mrs r0, CONTROL");
	asm volatile("orrs r0, r0, #0x1");
	asm volatile("orrs r0, r0, #0x2");
	asm volatile("cpsie i");
	asm volatile("msr CONTROL, r0");
	asm volatile("isb");
	asm volatile("dsb");

	asm volatile("ldr lr,=__user_data_start+1");
	asm volatile("bx lr");

	/* fault blinks @~2 Hz, spl counts 0-7 */
	
        while (1) {
	    volatile unsigned int i;
	    volatile unsigned int j;
	    for (i=0; i < 0x1ffff; i++)
		;

	    teensy_gpio_led_spl(j % 8);
	    
	    led_fault(j % 2);

	    i=0;
	    j++;
        };
}

#endif /* KERNEL */
